// Задача 13: Напишите программу, которая выводит третью цифру заданного числа или сообщает, 
// что третьей цифры нет. Выполнить с помощью числовых операций (целочисленное деление, остаток от деления).
// 645 -> 5
// 78 -> третьей цифры нет
// 32679 -> 6

Console.Write("Введите натуральное число: ")
int numberA = Convert.ToInt32(Console.ReadLine());

void ThirdDigit(num)
{
    result = numberA / 10
    if 
} 