// Напишите программу, которая принимает на вход число А и выдает сумму чисел от 1 до А.

Console.WriteLine("Введите число: ");